WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
// From the Sata sheet Table 82 the calibration value was read at 3.3v.
#define MEADOW_ADC_VOLTAGE_ADC_CAL_TAKEN (3.30)

// With a 12-bit ADC this is the maximum count that can be read is 4095
#define MEADOW_ADC_MAX_ADC_COUNT_DOUBLE (4095.0)

#if defined CONFIG_ADC_TESTS
// This define is only used for specific testing
#define MEADOW_ADC_TEST_TOGGLE_ADC_INPUT (0)
#endif 

#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
#define ADC_TEST_PIN_CCM_D03_PB8   (GPIO_OUTPUT | GPIO_PUSHPULL | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN8)
#define ADC_TEST_PIN_CCM_D04_PB9   (GPIO_OUTPUT | GPIO_PUSHPULL | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN9)
#endif

// /************************************************************************************
//  * Private Data
//  ************************************************************************************/
// From data sheet - GPIO to ADC1 channel input map
// Entries represent the STM32F7's valid GPIOs the can be used for ADC1 or
// ADC2. ADC3 has a few others that we'll ignore them for now.
// The following values are matched to those supplied by the caller, but here
// the position (0-16) defines the ADC multiplex position of the switch (see
// Ref Man Figure 71). Other values are not used.
static uint8_t _gpioAdcChanMap[] =
{
  0x00,      // Chan 0 = PA0
  0x01,      // Chan 1 = PA1
  0x02,      // Chan 2 = PA2
  0x03,      // Chan 3 = PA3
  0x04,      // Chan 4 = PA4
  0x05,      // Chan 5 = PA5
  0x06,      // Chan 6 = PA6
  0x07,      // Chan 7 = PA7
  0x10,      // Chan 8 = PB0
  0x11,      // Chan 9 = PB1
  0x20,      // Chan 10 = PC0
  0x21,      // Chan 11 = PC1
  0x22,      // Chan 12 = PC2
  0x23,      // Chan 13 = PC3
  0x24,      // Chan 14 = PC4
  0x25,      // Chan 15 = PC5
};
#define MEADOW_ADC_GPIO_CHAN_MAP_LENGTH (sizeof(_gpioAdcChanMap))

DMA_HANDLE _dmaHandle;
uint16_t *_dmaAdcBuf;     // This will contain ADC values (0-4095)

// These are user provided configuration values that must be persisted.
double *_userVoltageResultBuf;
static uint32_t _userGpioXferCount;

// Calibration reference value
static double _doubVrefInCal;

// Semaphores for releasing caller's thread when gpio or bat/temp done
static sem_t _gpioDoneSem;
static sem_t _injectionDoneSem;

static bool _hardwareConfigDone;
static bool _isFirstTimeInitDone = false;
static bool _isMeadowAdcInitialized;
static bool _isReinitialization;

#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
static int _noChangeCnt;
#endif

// /************************************************************************************
//  * Private Function Prototypes
//  ************************************************************************************/

static int meadow_adc_hardware_initialize(void);
static void meadow_adc_turn_on(void);
static void meadow_adc_restart(void);
static int meadow_adc_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan);
static int meadow_adc_fill_seq_chan(uint32_t *regval, uint32_t seqRegMaxGpios,
          uint32_t initRegShift, uint8_t *userGpioList);
static int meadow_adc_read_injected_temp_vref(uint16_t *adcTempReading, uint16_t *adcVrefInCal);
static int meadow_adc_read_injected_vbat(uint16_t *adcBatteryReading);
static int meadow_adc_convert_adc_to_voltage(uint16_t adcValue, double *convertedVoltage);
static int meadow_adc_check_first_func_call(void);
static int meadow_adc_config_sequence_regs(uint32_t userGpioXferCount, uint8_t *userGpioList);
static void meadow_adc_dma_initialize(uint16_t *dmaAdcBuf, uint32_t userGpioXferCount);
static int meadow_adc_read_injected_common(uint16_t *analogIn18, uint16_t *analogIn17);

/************************************************************************************
 * Private Functions
 ************************************************************************************/
// DMA ISR
static void meadow_adc_dma_isr(DMA_HANDLE handle, uint8_t status,
            FAR void *arg)
{
  uint32_t regval;
  // uint32_t baseADCAddr = (uint32_t)arg;
  // static int execCnt = 0;

  // Without this call the buffer's data is usually not correct
  up_invalidate_dcache((uintptr_t)_dmaAdcBuf,
                       (uintptr_t)_dmaAdcBuf + MEADOW_ADC_MAX_DMA_BUFFER_SIZE);

  // The DMA controller hardware can be programmed to call for the following
  // Discription        Event Flag    Enable control bit
  // -----------        ----------    ------------------
  // Half-transfer          HTIF            HTIE
  // Transfer complete      TCIF            TCIE
  // Transfer error         TEIF            TEIE
  // FIFO overrun/underrun  FEIF            FEIE
  // Direct mode error      DMEIF           DMEIE

  // Note: The interrupt has already been handled in the STM32_DMA_LISR_OFFSET
  // or STM32_DMA_HISR_OFFSET registers by the Nuttx code in stm32_dma.c This
  // function stm32_dmainterrupt() in nuttx/arch/arm/src/stm32/stm32_dma_v2.c,
  // is the function whose call that got us here.
  // The interrupt values are in the 8 bit 'status' field. The fields can be
  // found in: nuttx/arch/arm/src/stm32f7/chip/stm32f76xx77xx_dma.h

#if defined CONFIG_ADC_TESTS
  if(status == 0)
  {
    syslog(1, "DMA ISR No Interrupts\n");
    return;
  }
  // Bit 0: Stream FIFO error interrupt flag
  if((status & DMA_STREAM_FEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:FIFO error\n");
  }

  // Bit 2: Stream direct mode error interrupt flag
  if((status & DMA_STREAM_DMEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:direct mode error\n");
  }

  // Bit 3: Stream Transfer Error flag
  if((status & DMA_STREAM_TEIF_BIT) != 0)
  {
    // CTEIF
    syslog(1, "DMA ISR reason:Transfer Error\n");
  }
  
  //------------------------------------------------------
  // Stream Half Transfer flag
  if((status & DMA_STREAM_HTIF_BIT) != 0)
  {
    // syslog(1, "DMA ISR reason:Half Transfer\n");
  }
#endif

  //------------------------------------------------------
  // Stream Transfer Complete flag
  if((status & DMA_STREAM_TCIF_BIT) != 0)
  {
#if defined CONFIG_ADC_TESTS
    syslog(1, "DMA ISR reason:Transfer Complete\n");
#endif

    // The following test code toggles a GPIO output to cause an ADC analog
    // input's value to also toggle above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
    static bool _previousA00High = false;

    // The following code is for testing using the following connections:
    // Connect one end of a 2k2 resistor to ADC_TEST_PIN_CCM_D03_PB8 and the other
    // end connected to two 4k7 resistors. Then connect the free end of one 4k7
    // resistor's to ground and connect the another 4k7 resistor's free end to
    // 3v3, the voltage at the junction, of the 3 resistors, will toggle about
    // 1 volt above and 1 volt below mid-way between ground and 3v3 when
    // ADC_TEST_PIN_CCM_D03_PB8 changes from high to low. With this junction
    // connected to an analog input pin it is easy to prove that all of the
    // ADC values are changing as desired.
    //
    // Look at the ADC value for GPIO_V2_A00_IN4_PA4. It should
    // change on every DMA transfer complete interrupt.
    if(_dmaAdcBuf[0] > 2048)
    {
      // Voltage now above the mid point "high"
      if(_previousA00High)
        _noChangeCnt++;             // Still high, error
      else
        _previousA00High = true;    // Was Low, now high

