WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Cycle through all the slots in this register
  for(regCnt = 0; regCnt < seqRegGpios; regCnt++)
  {
    // For entry Pin/Port what 'ADC input' channel
    ret = meadow_adc_chan_from_pinid(userGpioList[regCnt], &adcInputChan);
    if(ret < 0)
      return ret;    // Error

    // Each entry takes 5 bits of register value
    *regval |= (adcInputChan << (initRegShift + (regCnt * 5)));
  }
  return OK;
}

//======================================================================
// This function will place the GPIO information into the sequence registers.
// This informs the ADC which GPIOs to convert and what order to do the
// conversion.
int meadow_adc_config_sequence_regs(uint32_t userGpioXferCount, uint8_t *userGpioList)
{
  uint32_t regval;
  
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions when ADC_CR1_SCAN is used. If there are no entries then
  // nothing will be converted. Basically, which input in which order.
  //
  // The values put in this field are found by looking at the target hardware.
  // For the FeatherV2, A00 is PA4. Next look at the data sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  // Since for ADC1 the value is '4' (it's also 4 for ADC2 and 3).
  int ret;
  uint32_t regCount = 0;
  uint32_t remainingCnt = userGpioXferCount;

  // Sequence Register 3 - ADC channels 1-6
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

#if defined CONFIG_ADC_TESTS
    syslog(1, "SEQ_3-initial transfer count:%lu\n", regCount);
#endif

    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);

  // Sequence Register 2 - ADC channels 7-12
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR2_OFFSET);
  regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

#if defined CONFIG_ADC_TESTS
    syslog(1, "SEQ_2-initial transfer count:%lu\n", regCount);
#endif

    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR2_OFFSET);
 
  // Sequence Register 1 - ADC channels 13-16
  regval = getreg32(STM32_ADC1_BASE+STM32_ADC_SQR1_OFFSET);
  regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

#if defined CONFIG_ADC_TESTS
    syslog(1, "SEQ_1-initial transfer count:%lu\n", regCount);
#endif
    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }

  // Last set the total number of transfers, also in TM32_ADC1_SQR1
  regval |= ((userGpioXferCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_BASE+STM32_ADC_SQR1_OFFSET);

  return OK;
}

//======================================================================
// Common code for reading Analog In 18 and Analog In 17 using injected mode.
// Note this code always obtains 2 adc values. Even if only one is needed
int meadow_adc_read_injected_common(uint16_t *analogIn18, uint16_t *analogIn17)
{
  uint32_t regval;

  // Injection Sequence Register - set ADC input at 18 since ADC_IN18 is used
  // by temperature and vbat depending on eht value of TSVREFE
  // Note: for the injected conversions the first is from JSQ3 and the second
  // from JSQ4 (see Ref Man 15.13.12). Why not 1 & 2, don't know.
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);
  regval &= ~0x003fffff;   // Clear all JSQR Bits
  // Note: 4 and 3? These may look wrong but are correct.
  regval |= (18 << ADC_JSQR_JSQ4_SHIFT);    // ADC_IN18 - Vsense (temp or vbat)
  regval |= (17 << ADC_JSQR_JSQ3_SHIFT);    // ADC_IN17 - Vrefint
  regval |= (1 << ADC_JSQR_JL_SHIFT);       // Set to 1 indicates 2 inputs
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);

  // Start ADC via Control Register 2 (CR2) - Start the ADC
  // JSWSTART cannot be set if ADON is not set
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_JSWSTART;       // Start injection ADC
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait for injected conversion to complete
  meadow_adc_buffer_takesem(&_injectionDoneSem);

  *analogIn18 = getreg16(STM32_ADC1_BASE + STM32_ADC_JDR2_OFFSET);
  *analogIn17 = getreg16(STM32_ADC1_BASE + STM32_ADC_JDR1_OFFSET);
  return OK;
}

//======================================================================
// Using injection get the adc value (0-4095) for temp and vbat
int meadow_adc_read_injected_temp_vref(uint16_t *adcTempReading, uint16_t *adcVrefInCal)
{
  int ret;
  uint32_t regval;
  uint16_t tempAnaIn18;
  uint16_t vrefAnaIn17;
  
  // CCR setup to read Temperature & Vref
  regval = getreg32(STM32_ADC_CCR);
  regval |= ADC_CCR_TSVREFE;        // 1=enable temperature sensor and reference
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // Per Data Sheet 5.3.25 startup time maximum is 10us tSTART
  usleep(10);

  ret = meadow_adc_read_injected_common(&tempAnaIn18, &vrefAnaIn17);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Injected common, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  if(adcTempReading != NULL)
    *adcTempReading = tempAnaIn18;

  if(adcVrefInCal != NULL)
    *adcVrefInCal = vrefAnaIn17;

  // Set or refresh the calibration reference
  _doubVrefInCal = (double)vrefAnaIn17;

