WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;     // 0=disable temperature/vref on this channel
  putreg32(regval, STM32_ADC_CCR);

  return ret;
}

//======================================================================
// This will read the raw ADC value for Vbat.
int meadow_adc_read_injected_vbat(uint16_t *adcBatteryReading)
{
  int ret;
  uint32_t regval;
  uint16_t analogIn17;
  uint16_t battAnaIn18;

  if(adcBatteryReading == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Read battery 'adcBatteryReading' can't be NULL\n",
              __FILE__, __LINE__);
    return -EINVAL;     // Invalid argument
  }

  // Setup to read Vbat
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;     // 0=disable temperature sensor and ref
  regval |= ADC_CCR_VBATE;        // 1=enable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // In this case we ignore the analogIn17 return value
  ret = meadow_adc_read_injected_common(&battAnaIn18, &analogIn17);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Read battery, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  *adcBatteryReading = battAnaIn18;

  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_VBATE;        // 0=disable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  return ret;
}

//======================================================================
// This function will do all the register configuration needed for ADC,
// excluding the DMA configuration. Some of these settings are needed for both
// regular ADC and injected ADC.
static int meadow_adc_hardware_reg_init (void)
{
  uint32_t regval;

#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  // This is used in testing it toggled high and low to switch the ADC input
  // voltage from high to low.
  stm32_configgpio(ADC_TEST_PIN_CCM_D03_PB8);
  stm32_gpiowrite(ADC_TEST_PIN_CCM_D03_PB8, false);
#endif

  // Insure the correct ADC clock is on. If not enabled it was impossible
  // to successfully write values into some ADC configuration registers.
  // If ADC2 or ADC3 are needed add RCC_APB2ENR_ADC2EN and RCC_APB2ENR_ADC3EN.
  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_ADC1EN;
  putreg32(regval, STM32_RCC_APB2ENR);

  regval = getreg32(STM32_RCC_AHB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_AHB1ENR);

  // Reset all the ADCs via Reset and Clock Control (RCC). For the STM32F7
  // there is a single bit for all ADCs. Other MCUs have a bit for each ADC.
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval |= RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Restore ADC from reset state
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval &= ~RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Set the ADC watchdog high and low threshold to max and min
  putreg32(0x00000fff, STM32_ADC1_BASE + STM32_ADC_HTR_OFFSET);
  putreg32(0x00000000, STM32_ADC1_BASE + STM32_ADC_LTR_OFFSET);

  //------------------------------------------------------------
  // ADC Sample Time Register - Determine how many clock cycles should each
  // conversion wait before beginning? See Ref Man sec 15.5.
  // With ADCCLK = 24MHz (see ADC_CCR_ADCPRE)
  // 000: 3 cycles Tconv = 3 + 12 = 15 cycles, 15/24,000,000 = 0.625 us
  // 001: 15 cycles
  // 010: 28 cycles
  // 011: 56 cycles
  // 100: 84 cycles
  // 101: 112 cycles Tconv = 112 + 12 = 124 cycles 124/24,000,000 = 4.667 us
  // 110: 144 cycles
  // 111: 480 cycles Tconv = 480 + 12 = 492 cycles 492/24,000,000 = 20.5 us
  // TESTING-Set all channels to the same default ADC_SMPR_DEFAULT
  // Set sample time for channels 10-18
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);
  // This #define will set all sample times to the same value. Here
  // ADC_SMPR_DEFAULTs are used to set ADC conversion the same.
  regval &= 0xf8000000;      // Clear Sample Time fields 10-18
  regval |= ADC_SMPR1_DEFAULT;

  // For Vbat and internal temperature overwrite with the longest sample time
  regval &= ~ADC_SMPR1_SMP17_MASK;
  regval |= (ADC_SMPR_480 << ADC_SMPR1_SMP17_SHIFT);
  regval &= ~ADC_SMPR1_SMP18_MASK;
  regval |= (ADC_SMPR_480 << ADC_SMPR1_SMP18_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);

  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);

  //---------------------------------------------------
  // ADC Control Register 1 (CR1)
  // Get the ADC Control Register 1 register. This register controls a lot of
  // options. I put the following in the same order as the Ref Man 15.13.2
  // This is mostly interrupt configuration
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_OVRIE;          // 0=Disable Overrun interrupt
  regval &= ~ADC_CR1_RES_MASK;      // Insure all resolution bit are clear
  regval |= ADC_CR1_RES_12BIT;      // Set resolution 00=12, 01=10, 10=8 or 11=6 bits
  regval &= ~ADC_CR1_AWDEN;         // 0=Disable Analog watchdog on regular channels
  regval &= ~ADC_CR1_JAWDEN;        // 0=Disable Analog watchdog on injected
  regval &= ~ADC_CR1_DISCNUM_MASK;  // Set number of discontinuous channels to 1
  regval &= ~ADC_CR1_JDISCEN;       // 0=Disable discontinuous mode on injected channels
  regval &= ~ADC_CR1_DISCEN;        // 0=Disable discontinuous mode on regular channels
  regval &= ~ADC_CR1_JAUTO;         // 0=Automatic Injected Group conversion
  regval &= ~ADC_CR1_AWDSGL;        // 0=Disable watchdog on single channel in scan mode
  // In Scan mode, the inputs selected through the ADC_SQRx
  regval |= ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval |= ADC_CR1_JEOCIE;         // 1=Enable interrupt for injected channels

  regval &= ~ADC_CR1_AWDIE;         // 0=Disable Analog Watchdog interrupt
  regval &= ~ADC_CR1_EOCIE;          // 0=Disable ADC interrupt for EOC
  regval &= ~ADC_CR1_AWDCH_MASK;    // Clear the watchdog channel to 00000=Chan 0
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  //---------------------------------------------------
  // ADC Control Register 2 (CR2)
  // Note:fields not defined in Nuttx header file have been ignored. Some
  // members of CR2 are set/cleared other places.
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_EXTEN_MASK;  // Clear bits
  regval |= ADC_CR2_EXTEN_NONE;   // No trigger from external sources
  regval &= ~ADC_CR2_ALIGN;       // 0=Right alignment (1=left alignment)
  regval &= ~ADC_CR2_EOCS;        // 1=End of each conversion, 0=End of sequence
  // Warning: the field names 'DDS' and 'DMA' exist in 2 ADC registers, CR2 and CCR.
  // DDS=0 No new DMA request is issued after the last transfer
  // DDS=1 DMA requests are issued as long as data are converted and DMA=1
  regval &= ~ADC_CR2_DDS;
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  // Disable continous conversion
  regval &= ~ADC_CR2_CONT;         // 0=Disable continuous conversion
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  //------------------------------------------------------------
  // ADC Common Control Register (CCR) [Common == for all ADCs]
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel

