WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // ADCPRE - Calculation based on PCLK2=96MHz (with 192MHz clock). Per Data
  // Sheet 5.3.24 pp 165, max ADC clock is 36MHz. Therefore, divide by 4
  // (96/4=24MHz) is the highest freq. For clock details see Meadow's board.h
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval |= ADC_CCR_ADCPRE_DIV4;    // 01=ADC prescaler PCLK2 divided by 4

  // DMA access mode for multi ADC mode
  // 00: DMA mode disabled
  // 01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
  // 10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
  // 11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2)
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval |= ADC_CCR_DMA_DISABLED;   // 00 = DMA Modes (multi-ADC mode only)
  regval &= ~ADC_CCR_DDS;           // 0=No new DMA request is issued after the last transfer
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  return OK;
}

//================================================================
// Enable ADC.
void meadow_adc_turn_on(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC. This must be done before every GPIO conversion series.
void meadow_adc_restart(void)
{
  uint32_t regval;

  // Enable DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  // Initiate the ADC conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Initialize DMA. This module leverages the NuttX DMA implementation.
void meadow_adc_dma_initialize(uint16_t *dmaAdcBuf, uint32_t userGpioXferCount)
{
  uint32_t regval;

  // The active configuration will have an active DMA handle from Nuttx
  if(_dmaHandle != NULL)
  {
    stm32_dmastop(_dmaHandle);
    stm32_dmafree(_dmaHandle); 
  }

  // Using Nuttx DMA to handle ADC DMA
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval |=  DMA_SCR_MSIZE_16BITS;  // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t) dmaAdcBuf,     // Destination buffer
                 userGpioXferCount,        // number to transfers
                 regval);

  // Provides DMA callback information
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  // But doesn't seem to honor 'false' 1/2 callbacks are still made
  stm32_dmastart(_dmaHandle, meadow_adc_dma_isr,
            (void *)STM32_ADC1_BASE, false);
}

//================================================================
// Call all the sub-initialization functions. This function prepares the ADC
// to do analog conversion.
// This only needs to be called once
int meadow_adc_hardware_initialize(void)
{
  int ret;

#if defined CONFIG_ADC_TESTS
  syslog(1, "Entered meadow_adc_hardware_initialize()\n");
#endif

  if(_hardwareConfigDone)
  {
    syslog(LOG_WARNING, "Can only initialize once\n");
    return -EALREADY;
  }

#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  _noChangeCnt = 0;
#endif

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, meadow_adc_conversion_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error calling irq_attach, ret:%d\n",
                  __FILE__, __LINE__, ret);
    return ret;
  }

  ret = meadow_adc_hardware_reg_init();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:hardware init\n, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  meadow_adc_turn_on();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  // We need to do the following before we can calculate any of the results.
  // Note: this doesn't use DMA, instead it uses the ADC's injected mode.
  ret = meadow_adc_read_injected_temp_vref(NULL, NULL);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Initial Temp/Cal Ref Conversion Error. ret:%d\n",
                  __FILE__, __LINE__, ret);
    return ret;
  }

#if defined CONFIG_ADC_TESTS
  // syslog(1, "Post hardware configuration register values:\n");
  // adc_test_display_basic_adc_regs(STM32_ADC1_BASE);
  // adc_test_display_basic_dma_regs();
#endif

  _hardwareConfigDone = true;

  return OK;
}

//=========================================================
// To get the most best result we'll use the following calculation taken
// from http://efton.sk/STM32/STM32_VREF.pdf.
// Per Data Sheet section 5.3.27. This reference voltage is considered in
// this calculation as _doubVrefInCal.
int meadow_adc_convert_adc_to_voltage(uint16_t adcValue, double *convertedVoltage)
{
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double voltage = (MEADOW_ADC_VOLTAGE_ADC_CAL_TAKEN * (double)adcValue * calRefVal_CAL + \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE / 2.0)) / \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE);

  // Don't know the cause but, the voltage returned is always exactly 0.50
  // volts too high. Tried this on different platforms (F7FeatherV2,
  // CCM versions) and it's always the same. Must be something in the math.
  *convertedVoltage = voltage - 0.5;
  return OK;
}

//=========================================================
// One time initialization. This may be called on each configuration.
int meadow_adc_check_first_func_call()
{
  if(! _isFirstTimeInitDone)
  {
    // Initialize and allocate things needed exactly once
    _isFirstTimeInitDone = true;
    
    _isReinitialization = false;
    _isMeadowAdcInitialized = false;

    // Global initiation
    _dmaHandle = NULL;
    _doubVrefInCal = 0.0;
    _hardwareConfigDone = false;
    
    // Signaling semaphore for GPIO conversion
    sem_init(&_gpioDoneSem, 0, 0);
    sem_setprotocol(&_gpioDoneSem, SEM_PRIO_NONE);

    // Signaling semaphore for Vbat and Temperature conversion
    sem_init(&_injectionDoneSem, 0, 0);
    sem_setprotocol(&_injectionDoneSem, SEM_PRIO_NONE);

    // Do before configuration
    _dmaAdcBuf = kmm_malloc(MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
    if(_dmaAdcBuf == NULL)
    {
      syslog(LOG_ERR, "%s@%d-Buffer space not available\n",
                  __FILE__, __LINE__);
      return -ENOMEM;   // Out of memory
    }

    memset(_dmaAdcBuf, 0, MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
  }
  else
  {
    _isReinitialization = true;
  }

  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// This function can handle as few as 1 GPIO and as many as 16 GPIOs with a
// buffer with space for all 16.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          double *resultBuffer)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff = 0;

#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, resultBuffer:%p\n",
            gpioCount, resultBuffer);
#endif

  if(resultBuffer == NULL)
  {
    syslog(1, "%s@%d-resultBuffer is NULL\n",
              __FILE__, __LINE__);
    return -EINVAL;   // Invalid argument
  }
  
  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for matching port/pin in the list
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to the ADC
    }

