WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_ERR, "%s@%d-(P%c%d) not valid pin\n",
              __FILE__, __LINE__,
              (gpioList[gpioListOff] >> 4) + 'A',
              gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  // Check if this is the very first time this has been called
  ret = meadow_adc_check_first_func_call();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow adc config, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Is this a re-initialization or the first time?
  if(_isReinitialization)
  {
    _hardwareConfigDone = false;
  }

  //----------------------------------------------
  // Passed the tests so save need user parameters and initialize. Note: this
  // may not be the very initialization as initialization can be repeated.
  _userGpioXferCount = gpioCount;
  _userVoltageResultBuf = resultBuffer;

  // There are 3 initialization steps to fully initialize the ADC for analog
  // GPIO and Battery/Temperature conversion. The following can be done early.
  // This is good since it is needed for reading the internal MCU temperature
  // and battery voltage.
  if(!_hardwareConfigDone)
  {
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Hardware initialize failed. ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }
  }

  // Configure the sequence registers. This give the sequence that the
  // conversion will execute
  ret = meadow_adc_config_sequence_regs(gpioCount, gpioList);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Initialization failed. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Initialize the DMA
  meadow_adc_dma_initialize(_dmaAdcBuf, _userGpioXferCount);

  _isMeadowAdcInitialized = true;
  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  int ret;

  if(! _isMeadowAdcInitialized)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not configured\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Since not doing continous conversion we need to start ADC each time
  meadow_adc_restart();

  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_gpioDoneSem);

  // The following is used to determine if the output truely follows the analog
  // input as it switches above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  // Note to execute the following display adds about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%s@%d-%04d-Error Count:%05d\n",
                  __FILE__, __LINE__, callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // ADC conversion must have completed. Now convert the collected data
  // to voltage and copy to the user's buffer.
  for(int valOff = 0; valOff < _userGpioXferCount; valOff++)
  {
    double convVoltage;

    // _dmaAdcBuf contain the adc output values (0-4095) placed there by DMA.
    //  Convert these values to a voltage and for the user.
    ret = meadow_adc_convert_adc_to_voltage(_dmaAdcBuf[valOff], &convVoltage);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Error:ADC to Voltage, ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }

    _userVoltageResultBuf[valOff] = convVoltage;
  }

  return ret;
}

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
//
// Quote from Ref Man 15.10
// "The temperature sensor output voltage changes linearly with temperature.
// The offset of this linear function depends on each chip due to process
// variation (up to 45°C from one chip to another).
// The internal temperature sensor is more suited for applications that detect
// temperature variations instead of absolute temperatures. If accurate
// temperature reading is required, an external temperature sensor should be
// used"
int meadow_adc_read_temp_vbat(double *batteryVoltage, double *tempValue)
{
  int ret;
  uint16_t adcTempReading;
  uint16_t adcVrefInCal;

  // Check if this is the very first time any function has been called
  ret = meadow_adc_check_first_func_call();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Reading Temp/Vbat failed. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Has the hardware configuration been done already?
  if(!_hardwareConfigDone)
  {
    // Hardware not yet configured. This is needed by both temp/vbat and GPIO
    // ADC but GPIO require more init. So, we'll only do what's needed and
    // the GPIO specific config will be done when needed.
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Reading Temp/Vbat failed. ret:%d\n",
              __FILE__, __LINE__, ret);
      return ret;
    }
  }

  // This must be done before reading Vbat because it reads and sets
  // _doubVrefInCal which is used for both temperature and voltage calculations
  // FWIW - meadow_adc_hardware_initialize() sets up the hardware but also
  // calls meadow_adc_read_injected_temp_vref(), internally, so the
  // following call is a duplicate, but only happens once.
  ret = meadow_adc_read_injected_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Temperature/Vref read error, ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

