WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // From Data Sheet (not Ref Man), temperatures calibration values have been
  // read at 30 and 110 degrees celsius. 
  double calAtDegC30_t1  = 30.0;     // Calibration temperature 1 in DegC
  double calAtDegC110_t2 = 110.0;    // Calibration temperature 2 in DegC
  // Get the STM factory calibration values stored in these registers.
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double tempCal1_TEMP1 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL30_ADDR);
  double tempCal2_TEMP2 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL110_ADDR);

  // The adc temperature measurement value (0-4095) needs to be converted to
  // a temperature value. To do the best conversion the information in the
  // Data Sheet needs to be incorporated in the math.
  // The following equation came from http://efton.sk/STM32/STM32_VREF.pdf.
  *tempValue = calAtDegC30_t1 + (calAtDegC110_t2 - calAtDegC30_t1) * \
            ((double)adcTempReading * calRefVal_CAL - \
            tempCal1_TEMP1 * _doubVrefInCal) / \
            (_doubVrefInCal * (tempCal2_TEMP2 - tempCal1_TEMP1));
  
  // Now do the same for the battery voltage
  uint16_t adcBatteryReading;
  ret = meadow_adc_read_injected_vbat(&adcBatteryReading);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Reading Vbat Error. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Convert the Vbat reading into a voltage value
  // Note:Per Ref Man section 15.11 the Battery voltage read is VBAT/4
  // We must multiple before conversion to get the correct value.
  double vbat;
  ret = meadow_adc_convert_adc_to_voltage(adcBatteryReading * 4, &vbat);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-VBat Conversion Error. ret:%d\n",
              __FILE__, __LINE__, ret);
    return ret;
  }

  // Per Data Sheet 2.17, any voltage below 1.65 is not allowed
  if(vbat < 1.0)
    *batteryVoltage = 0.0;
  else
    *batteryVoltage = vbat;

  return OK;
}

